{
  "title": "Hagar and Ishmael",
  "sources": [
    {
      "name": "J",
      "verses": [
        {
          "chapter": 16,
          "verse": 1,
          "text": "Now Sarai, Abrams wife, bore him no children. She had an Egyptian slave whose name was Hagar,"
        },
        {
          "chapter": 16,
          "verse": 2,
          "text": "and Sarai said to Abram, 'You see that the Lord has prevented me from bearing children; go in to my slave; it may be that I shall obtain children by her.' And Abram listened to the voice of Sarai."
        },
        {
          "chapter": 16,
          "verse": 4,
          "text": "He went in to Hagar, and she conceived, and when she saw that she had conceived, she looked with contempt on her mistress."
        },
        {
          "chapter": 16,
          "verse": 5,
          "text": "Then Sarai said to Abram, 'May the wrong done to me be on you! I gave my slave to your embrace, and when she saw that she had conceived, she looked on me with contempt. May the Lord judge between you and me!'"
        },
        {
          "chapter": 16,
          "verse": 6,
          "text": "But Abram said to Sarai, 'Your slave is in your power; do to her as you please.' Then Sarai dealt harshly with her, and she ran away from her."
        },
        {
          "chapter": 16,
          "verse": 7,
          "text": "The angel of the Lord found her by a spring of water in the wilderness, the spring on the way to Shur."
        },
        {
          "chapter": 16,
          "verse": 8,
          "text": "And he said, 'Hagar, slave of Sarai, where have you come from and where are you going?' She said, 'I am running away from my mistress Sarai.'"
        },
        {
          "chapter": 16,
          "verse": 9,
          "text": "The angel of the Lord said to her, 'Return to your mistress, and submit to her.'"
        },
        {
          "chapter": 16,
          "verse": 10,
          "text": "The angel of the Lord also said to her, 'I will so greatly multiply your offspring that they cannot be counted for multitude.'"
        },
        {
          "chapter": 16,
          "verse": 11,
          "text": "And the angel of the Lord said to her, 'Now you have conceived and shall bear a son; you shall call him Ishmael, for the Lord has given heed to your affliction."
        },
        {
          "chapter": 16,
          "verse": 12,
          "text": "He shall be a wild ass of a man, with his hand against everyone, and everyone's hand against him, and he shall live at odds with all his kin.'"
        },
        {
          "chapter": 16,
          "verse": 13,
          "text": "So she named the Lord who spoke to her, 'You are El-roi,' for she said, 'Have I really seen God and remained alive after seeing him?'"
        },
        {
          "chapter": 16,
          "verse": 14,
          "text": "Therefore the well was called Beer-lahai-roi; it lies between Kadesh and Bered."
        }
        ]
    },
    {
      "name": "P",
      "verses": [
            {
            "chapter": 16,
            "verse": 3,
            "text": "So, after Abram had lived ten years in the land of Canaan, Sarai, Abram's wife, took Hagar the Egyptian, her slave, and gave her to her husband Abram as a wife."
            },
            {
            "chapter": 16,
            "verse": 15,
            "text": "Hagar bore Abram a son, and Abram named his son, whom Hagar bore, Ishmael."
            },
            {
            "chapter": 16,
            "verse": 16,
            "text": "Abram was eighty-six years old when Hagar bore him Ishmael."
            }
        ]
    },
    {
      "name": "E",
      "verses": [
            {
            "chapter": 21,
            "verse": 8,
            "text": "The child grew and was weaned, and Abraham made a great feast on the day that Isaac was weaned."
            },
            {
            "chapter": 21,
            "verse": 9,
            "text": "But Sarah saw the son of Hagar the Egyptian, whom she had borne to Abraham, playing with her son Isaac."
            },
            {
            "chapter": 21,
            "verse": 10,
            "text": "So she said to Abraham, 'Cast out this slave woman with her son, for the son of this slave woman shall not inherit along with my son Isaac.'"
            },
            {
            "chapter": 21,
            "verse": 11,
            "text": "The matter was very distressing to Abraham on account of his son."
            },
            {
            "chapter": 21,
            "verse": 12,
            "text": "But God said to Abraham, 'Do not be distressed because of the boy and because of your slave woman; whatever Sarah says to you, do as she tells you, for it is through Isaac that offspring shall be named for you."
            },
            {
            "chapter": 21,
            "verse": 13,
            "text": "As for the son of the slave woman, I will make a nation of him also, because he is your offspring.'"
            },
            {
            "chapter": 21,
            "verse": 14,
            "text": "So Abraham rose early in the morning and took bread and a skin of water and gave it to Hagar, putting it on her shoulder, along with the child, and sent her away. And she departed and wandered about in the wilderness of Beer-sheba."
            },
            {
            "chapter": 21,
            "verse": 15,
            "text": "When the water in the skin was gone, she cast the child under one of the bushes."
            },
            {
            "chapter": 21,
            "verse": 16,
            "text": "Then she went and sat down opposite him a good way off, about the distance of a bowshot, for she said, 'Do not let me look on the death of the child.' And as she sat opposite him, she lifted up her voice and wept."
            },
            {
            "chapter": 21,
            "verse": 17,
            "text": "And God heard the voice of the boy, and the angel of God called to Hagar from heaven and said to her, 'What troubles you, Hagar? Do not be afraid, for God has heard the voice of the boy where he is."
            },
            {
            "chapter": 21,
            "verse": 18,
            "text": "Come, lift up the boy and hold him fast with your hand, for I will make a great nation of him.'"
            },
            {
            "chapter": 21,
            "verse": 19,
            "text": "Then God opened her eyes, and she saw a well of water. She went and filled the skin with water and gave the boy a drink."
            }
        ]
    }
  ]
}
