{
  "title": "Water from the Rock at Meribah",
  "sources": [
    {
      "name": "E",
      "verses": [
        {
          "chapter": 17,
          "verse": 2,
          "text": "The people quarreled with Moses and said, 'Give us water to drink.' Moses said to them, 'Why do you quarrel with me? Why do you test the Lord?'"
        },
        {
          "chapter": 17,
          "verse": 3,
          "text": "But the people thirsted there for water, and the people complained against Moses and said, 'Why did you bring us out of Egypt, to kill us and our children and livestock with thirst?'"
        },
        {
          "chapter": 17,
          "verse": 4,
          "text": "So Moses cried out to the Lord, 'What shall I do for this people? They are almost ready to stone me.'"
        },
        {
          "chapter": 17,
          "verse": 5,
          "text": "The Lord said to Moses, 'Go on ahead of the people and take some of the elders of Israel with you; take in your hand the staff with which you struck the Nile and go."
        },
        {
          "chapter": 17,
          "verse": 6,
          "text": "I will be standing there in front of you on the rock at Horeb. Strike the rock, and water will come out of it, so that the people may drink.' Moses did so, in the sight of the elders of Israel."
        },
        {
          "chapter": 17,
          "verse": 7,
          "text": "He called the place Massah and Meribah, because the Israelites quarreled and tested the Lord, saying, 'Is the Lord among us or not?'"
        }
      ]
    },
    {
      "name": "P",
      "verses": [
        {
          "chapter": 20,
          "verse": 2,
          "text": "Now there was no water for the community, and the people gathered in opposition to Moses and Aaron."
        },
        {
          "chapter": 20,
          "verse": 3,
          "text": "They quarreled with Moses and said, 'If only we had died when our brothers fell dead before the Lord!"
        },
        {
          "chapter": 20,
          "verse": 4,
          "text": "Why did you bring the Lord's community into this wilderness, that we and our livestock should die here?"
        },
        {
          "chapter": 20,
          "verse": 5,
          "text": "Why did you bring us up out of Egypt to this terrible place? It has no grain or figs, grapevines or pomegranates. And there is no water to drink!'"
        },
        {
          "chapter": 20,
          "verse": 6,
          "text": "Moses and Aaron went from the assembly to the entrance to the tent of meeting and fell facedown, and the glory of the Lord appeared to them."
        },
        {
          "chapter": 20,
          "verse": 7,
          "text": "The Lord said to Moses,"
        },
        {
          "chapter": 20,
          "verse": 8,
          "text": "'Take the staff, and you and your brother Aaron gather the assembly together. Speak to that rock before their eyes and it will pour out its water. You will bring water out of the rock for the community so they and their livestock can drink.'"
        },
        {
          "chapter": 20,
          "verse": 9,
          "text": "So Moses took the staff from the Lord's presence, just as he commanded him."
        },
        {
          "chapter": 20,
          "verse": 10,
          "text": "He and Aaron gathered the assembly together in front of the rock and Moses said to them, 'Listen, you rebels, must we bring you water out of this rock?'"
        },
        {
          "chapter": 20,
          "verse": 11,
          "text": "Then Moses raised his arm and struck the rock twice with his staff. Water gushed out, and the community and their livestock drank."
        },
        {
          "chapter": 20,
          "verse": 12,
          "text": "But the Lord said to Moses and Aaron, 'Because you did not trust in me enough to honor me as holy in the sight of the Israelites, you will not bring this community into the land I give them.'"
        },
        {
          "chapter": 20,
          "verse": 13,
          "text": "These were the waters of Meribah, where the Israelites quarreled with the Lord and where he was proved holy among them."
        }
      ]
    }
  ]
}
